CSI API ETABS v1

# Visual Basic or C# 2012 (.NET 4.0)

---

  1. Create a new project of type Windows Form Application

  2. Add a reference to “ETABSv1.dll” to the .NET project. This early binds to the API using the .NET interface.

  3. Add a button to the form, double-click the button, then paste in the following, ready-to-run code.

C#

VB

C++

F#

Copy

         using System;
         using System.Collections.Generic;
         using System.ComponentModel;
         using System.Data;
         using System.Drawing;
         using System.Linq;
         using System.Text;
         using System.Windows.Forms;

         namespace WindowsFormsApplication1
         {
             public partial class Form1 : Form
             {
                 public Form1()
                 {
                     InitializeComponent();
                 }

                 private void button1_Click(object sender, EventArgs e)
                 {
                     //set the following flag to true to attach to an existing instance of the program
                     //otherwise a new instance of the program will be started
                     bool AttachToInstance;
                     AttachToInstance = false;

                     //set the following flag to true to manually specify the path to ETABS.exe
                     //this allows for a connection to a version of ETABS other than the latest installation
                     //otherwise the latest installed version of ETABS will be launched
                     bool SpecifyPath;
                     SpecifyPath = false;

                     //if the above flag is set to true, specify the path to ETABS below
                     string ProgramPath;
                     ProgramPath = @"C:\Program Files\Computers and Structures\ETABS 19\ETABS.exe";

                     //full path to the model
                     //set it to an already existing folder
                     string ModelDirectory = @"C:\CSi_ETABS_API_Example";
                     try
                     {
                         System.IO.Directory.CreateDirectory(ModelDirectory);
                     }
                     catch (Exception ex)
                     {
                         MessageBox.Show("Could not create directory: " + ModelDirectory);
                     }

                     string ModelName = "ETABS_API_Example.edb";
                     string ModelPath = ModelDirectory + System.IO.Path.DirectorySeparatorChar + ModelName;

                     //dimension the ETABS Object as cOAPI type
                     ETABSv1.cOAPI myETABSObject = null;

                     //Use ret to check if functions return successfully (ret = 0) or fail (ret = nonzero)
                     int ret = 0;

                     //create API helper object
                     ETABSv1.cHelper myHelper;
                     try
                     {
                         myHelper = new ETABSv1.Helper();
                     }
                     catch (Exception ex)
                     {
                         MessageBox.Show("Cannot create an instance of the Helper object");
                         return;
                     }

                     if (AttachToInstance)
                     {
                         //attach to a running instance of ETABS
                         try
                         {
                             //get the active ETABS object
                             myETABSObject = myHelper.GetObject("CSI.ETABS.API.ETABSObject");
                         }
                         catch (Exception ex)
                         {
                             MessageBox.Show("No running instance of the program found or failed to attach.");
                             return;
                         }
                     }
                     else
                     {
                         if (SpecifyPath)
                         {
                             //'create an instance of the ETABS object from the specified path
                             try
                             {
                                 //create ETABS object
                                 myETABSObject = myHelper.CreateObject(ProgramPath);
                             }
                             catch (Exception ex)
                             {
                                 MessageBox.Show("Cannot start a new instance of the program from " + ProgramPath);
                                 return;
                             }
                         }
                         else
                         {
                             //'create an instance of the ETABS object from the latest installed ETABS
                             try
                             {
                                 //create ETABS object
                                 myETABSObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject");
                             }
                             catch (Exception ex)
                             {
                                 MessageBox.Show("Cannot start a new instance of the program.");
                                 return;
                             }
                         }
                         //start ETABS application
                         ret = myETABSObject.ApplicationStart();
                     }

                     //Get a reference to cSapModel to access all API classes and functions
                     ETABSv1.cSapModel mySapModel = default(ETABSv1.cSapModel);
                     mySapModel = myETABSObject.SapModel;

                     //Initialize model
                     ret = mySapModel.InitializeNewModel();

                     //Create steel deck template model
                     ret = mySapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24);

                     //Save model
                     ret = mySapModel.File.Save(ModelPath);

                     //Run analysis
                     ret = mySapModel.Analyze.RunAnalysis();

                     //Close ETABS
                     myETABSObject.ApplicationExit(false);

                     //Clean up variables
                     mySapModel = null;
                     myETABSObject = null;

                     //Check ret value
                     if (ret == 0)
                     {
                         MessageBox.Show("API script completed successfully.");
                     }
                     else
                     {
                         MessageBox.Show("API script FAILED to complete.");
                     }
                 }
             }
         }

         Public Class Form1

             Private Sub Button1_Click(sender As Object, e As EventArgs) Handles Button1.Click

                 'set the following flag to True to attach to a running instance of the program
                 'otherwise a new instance of the program will be started
                 Dim AttachToInstance As Boolean
                 AttachToInstance = True

                 'set the following flag to True to manually specify the path to ETABS.exe
                 'this allows for a connection to a version of ETABS other than the latest installation
                 'otherwise the latest installed version of ETABS will be launched
                 Dim SpecifyPath As Boolean
                 SpecifyPath = False

                 'if the above flag is set to True, specify the path to ETABS below
                 Dim ProgramPath As String
                 'ProgramPath = "C:\Program Files (x86)\Computers and Structures\ETABS 19\ETABS.exe"

                 'full path to the model
                 'set it to an already existing folder
                 Dim ModelDirectory As String = "C:\CSi_ETABS_API_Example"
                 Try
                     System.IO.Directory.CreateDirectory(ModelDirectory)
                 Catch ex As Exception
                     MsgBox("Could not create directory: " + ModelDirectory)
                 End Try

                 Dim ModelName As String = "ETABS_API_Example.edb"
                 Dim ModelPath As String = ModelDirectory + System.IO.Path.DirectorySeparatorChar + ModelName

                 'dimension the ETABS Object as cOAPI type
                 Dim myETABSObject As ETABSv1.cOAPI = Nothing

                 'Use ret to check if functions return successfully (ret = 0) or fail (ret = nonzero)
                 Dim ret As Integer

                 'create API helper object
                 Dim myHelper As ETABSv1.cHelper
                 Try
                     myHelper = New ETABSv1.Helper
                 Catch ex As Exception
                     MsgBox("Cannot create an instance of the Helper object")
                 End Try

                 If AttachToInstance Then
                     'attach to a running instance of ETABS
                     Try
                         'get the active ETABS object
                         myETABSObject = myHelper.GetObject("CSI.ETABS.API.ETABSObject")
                     Catch ex As Exception
                         MsgBox("No running instance of the program found or failed to attach.")
                         Return
                     End Try
                 Else
                     If SpecifyPath Then
                         Try
                             'create an instance of the ETABS object from the specified path
                             myETABSObject = myHelper.CreateObject(ProgramPath)
                         Catch ex As Exception
                             MsgBox("Cannot start a new instance of the program from " + ProgramPath)
                             Return
                         End Try
                     Else
                         Try
                             'create an instance of the ETABS object from the latest installed ETABS
                             myETABSObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
                         Catch ex As Exception
                             MsgBox("Cannot start a new instance of the program.")
                             Return
                         End Try
                     End If

                     'start ETABS application
                     ret = myETABSObject.ApplicationStart()
                 End If

                 'Get a reference to cSapModel to access all API classes and functions
                 Dim mySapModel As ETABSv1.cSapModel
                 mySapModel = myETABSObject.SapModel

                 'Initialize model
                 ret = mySapModel.InitializeNewModel()

                 'Create steel deck template model
                 ret = mySapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)

                 'Save model
                 ret = mySapModel.File.Save(ModelPath)

                 'Run analysis
                 ret = mySapModel.Analyze.RunAnalysis()

                 'Close ETABS
                 myETABSObject.ApplicationExit(False)

                 'Clean up variables
                 mySapModel = Nothing
                 myETABSObject = Nothing

                 'Check ret value
                 If ret = 0 Then
                     MsgBox("API script completed successfully.")
                 Else
                     MsgBox("API script FAILED to complete.")
                 End If

             End Sub
         End Class

No code example is currently available or this language may not be supported.

No code example is currently available or this language may not be supported.

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com